app/Controllers/Admins.php

    public function index()
    {

        if (!session()->has('logged_admin')) {
            return redirect()->to(base_url().'login');
        }

        $model = new AdminModel();

        $data['admin'] = $model->findAll(); // Fetch all document
---
SELECT *
FROM `admin`