app/Controllers/AdminManagement.php

    public function index()
    {

        $model = new AdminModel();

        $data['admin'] = $model->findAll(); // Fetch all document
---
SELECT *
FROM `admin`