app/Controllers/Courses.php

   public function index()
   {
       // Initialize Syllabus Model
       $departmentModel = new DepartmentModel();

       // Retrieve all department
       $department = $departmentModel->findAll();
---
SELECT *
FROM `department`

   public function syllabus_subjects($department_id, $syllabus_id)
    {
        // Initialize models
        $departmentModel = new DepartmentModel();
        $syllabusModel = new SyllabusModel();
        $subjectModel = new SubjectModel();

        // Get department details
        $department = $departmentModel->find($department_id);

        // Get syllabus details
        $syllabus = $syllabusModel->find($syllabus_id);
---
SELECT *
FROM `syllabus`
WHERE `syllabus`.`syllabus_id` = '3'