app/Controllers/Courses.php

SELECT *
FROM `department`
---
   public function index()
   {
       // Initialize Syllabus Model
       $departmentModel = new DepartmentModel();

       // Retrieve all department
       $department = $departmentModel->findAll();

SELECT *
FROM `department`
WHERE `department`.`department_id` = '1'
---
   public function department_syllabus($department_id)
{
    $departmentModel = new DepartmentModel();
    $deptosylModel = new DeptosylModel();

    // Get the department details
    $department = $departmentModel->find($department_id);

SELECT *
FROM `subject`
WHERE `subject`.`subject_id` = '16'
SELECT *
FROM `slides`
WHERE `subject_id` = '16'
---
public function view_slides($subjectId)
{
    $subject = $this->subjectModel->find($subjectId);
    $slides = $this->slideModel->where('subject_id', $subjectId)->findAll();