app/Controllers/Users.php

SELECT *
FROM `user`
---
    public function index()
    {

        if (!session()->has('logged_admin')) {
            return redirect()->to(base_url().'login');
        }

        $model = new UserModel();

        $data['user'] = $model->findAll(); // Fetch all document

SELECT *
FROM `user`
WHERE `user`.`uid` = '40'
---
    public function edit($uid)
    {

        if (!session()->has('logged_admin')) {
            return redirect()->to(base_url().'login');
        }

        $model = new UserModel();
        $data['user'] = $model->find($uid);

DELETE FROM `user`
WHERE `uid` IN ('39')
---
    public function delete($uid)
    {

        if (!session()->has('logged_admin')) {
            return redirect()->to(base_url().'login');
        }

        $model = new UserModel();
        $model->delete($uid);