app/Controllers/UserManagement.php

SELECT *
FROM `user`
---
    public function index()
    {

        $model = new UserModel();

        $data['user'] = $model->findAll(); // Fetch all document

INSERT INTO `user` (`name`, `email`, `username`, `department`, `password`, `confirmPassword`) VALUES ('Chamaali', 'chamaalidilka@gmail.com', '19APC4055', 'Computing and Information Systems', '123', '123')
---
    public function store()
    {
        $model = new UserModel();

        if (!$this->validate([
            'name'   => 'required',
            'email' => 'required',
            'username'   => 'required',
            'password' => 'required',
            'confirmPassword'   => 'required'
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Save data
        $model->save([
            'name'   => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'username'   => $this->request->getPost('username'),
            'password' => $this->request->getPost('password'),
            'confirmPassword'   => $this->request->getPost('confirmPassword'),

        ]);