app/Models/LoginModel.php

SELECT `uniid`, `status`, `password`
FROM `user`
WHERE `username` = 'perera@foc.sab.ac.lk'
---
    public function verifyUsername($username)
    {
        $builder = $this->db->table('user');
        $builder->select('uniid, status, password');
        $builder->where('username', $username);
        $result = $builder->get();

SELECT `id`, `name`, `email`, `telephone`, `password`, `access_level`
FROM `admin`
WHERE `email` = 'perera@foc.sab.ac.lk'
---
    public function verifyAdminUsername($username)
    {
        $builder = $this->db->table('admin');
        $builder->select('id, name, email, telephone, password, access_level');
        $builder->where('email', $username); // Using email for admin login
        $result = $builder->get();