app/Models/SubjectModel.php

    public function getSubjectsBySemester($department_id, $syllabus_id)
    {
        return $this->select('semester.semester_id, semester.semester_number,
                              subject.subject_id, subject.subject_code, subject.subject_name')
            ->join('semester', 'semester.semester_id = subject.semester_id')
            ->where('subject.department_id', $department_id)
            ->where('subject.syllabus_id', $syllabus_id)
            ->orderBy('semester.semester_number')
            ->findAll();
---
SELECT `semester`.`semester_id`, `semester`.`semester_number`, `subject`.`subject_id`, `subject`.`subject_code`, `subject`.`subject_name`
FROM `subject`
JOIN `semester` ON `semester`.`semester_id` = `subject`.`semester_id`
WHERE `subject`.`department_id` = '4'
AND `subject`.`syllabus_id` = '3'
ORDER BY `semester`.`semester_number`