app/Models/UserModel.php

SELECT COUNT(*) AS `numrows` FROM `user`
SELECT `department`, COUNT(*) as dept_count
FROM `user`
GROUP BY `department`
---
      public function getDepartmentPercentages()
      {
          // Count total users
          $totalUsers = $this->countAll();

          // Get department counts
          $departmentQuery = $this->select('department, COUNT(*) as dept_count')
                                  ->groupBy('department')
                                  ->get();